Revit 2027 API
ScheduleDefinition.CanFilterByParameterExistence Method
 Checks whether a field can be used with a HasParameter filter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanFilterByParameterExistence(
	ScheduleFieldId fieldId
)
Public Function CanFilterByParameterExistence (
	fieldId As ScheduleFieldId
) As Boolean
public:
bool CanFilterByParameterExistence(
	ScheduleFieldId^ fieldId
)
member CanFilterByParameterExistence :
        fieldId : ScheduleFieldId -> bool
Parameters
fieldId ScheduleFieldId
 The ID of the field to check.
Return Value
Boolean
 True if the field can be used with a HasParameter filter, false otherwise.
Exceptions
Exception | Condition
ArgumentException |  fieldId is not the ID of a field in this ScheduleDefinition.
ArgumentNullException |  A non-optional argument was null
Remarks
 The HasParameter filter type only supports shared parameters, and only with the Instance or ElementType field types.
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace